package jungrie.com.kh;

public class Jungri {
	
	/*Run클래스: 실행 프로그램의 시작점 뷰에서 메인화면 출력하는 기능을 호출
	 * View클래스 : 프로그램 사용자와의 상호작용 (출력문이나 , 입력받기 용) 말 그대로 화면 사용자에게 입력값 요청을 받는다. 이 결과를 보고 성공/실패 여부 판단 후에 결과를 출력
	 * Controller클래스 : 흐름제어를 위해 요청을 처리하는데 그중에서 제어를 맡는다 . model과 view사이에서 흐름을 제어한다? 결과 반환 이결과를 뷰에게 주고
	 * Model : 데이터 관련 작업 실질적으로 값과 관련된것을 다루는 곳 저당소, 연산 ,입/출력을 함
	 * 안에 Service클래스: 비즈니스 로직 의사결정 코드 예를 들어서 데이터가 들어와서 인서트가 될때 데이터 값이 20자 이상 들어가면 안돼 그것을 검사하는게 여기다. 결과 반환 이 결과를 컨트롤러에게 주고
	 * DAO 클래스 : SQL문 실행하고 DB에요청한다  그 후 결과값 Query결과를 매핑함
	 * Template : JDBC관련 중복코드를 연결 드라이버 등록 반납 등을 수행한다.
	 * VO :값의 저장
	 * DTO:값의 전달
	 * 
	 * 클래스 외부의 properties(설정값 받는데 사용) ,mapper(sql문 받는데 사용)
	 * 00
	 * 
	 * DB :요청을 받으면 응답을 해줌 
	 * 
	 * 
	 */
	

	
}
